---
type: TransactionGroup
namespace: Autodesk.Revit.DB
version: 2024
members: 14
tags: [revit-api, class]
---

# TransactionGroup

`Autodesk.Revit.DB.TransactionGroup` · Revit 2024 · 14 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | TransactionGroup | — | `` |
| Method | Assimilate | 2011 | `public TransactionStatus Assimilate ()` |
| Method | Commit | 2011 | `public TransactionStatus Commit ()` |
| Method | Dispose | — | `public void Dispose ()` |
| Method | GetName | 2011 | `public string GetName ()` |
| Method | GetStatus | 2011 | `public TransactionStatus GetStatus ()` |
| Method | HasEnded | 2011 | `public bool HasEnded ()` |
| Method | HasStarted | 2011 | `public bool HasStarted ()` |
| Method | RollBack | 2011 | `public TransactionStatus RollBack ()` |
| Method | SetName | 2011 | `public void SetName ( string name )` |
| Method | Start | — | `` |
| Method | Start | 2011 | `public TransactionStatus Start ()` |
| Property | IsFailureHandlingForcedModal | 2013 | `public bool IsFailureHandlingForcedModal { get ; set ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |